implemented loop
